; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	image1 - mode
	thermograph2 - mode
	infrared0 - mode
	GroundStation0 - direction
	Star4 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	Star6 - direction
	Star3 - direction
	GroundStation2 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star3)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument2 image1)
	(calibration_target instrument2 Star4)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star6)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph2)
	(supports instrument4 image1)
	(calibration_target instrument4 Star4)
	(supports instrument5 image1)
	(supports instrument5 thermograph2)
	(supports instrument5 infrared0)
	(calibration_target instrument5 Star3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet8)
	(supports instrument6 thermograph2)
	(supports instrument6 image1)
	(supports instrument6 infrared0)
	(calibration_target instrument6 Star6)
	(calibration_target instrument6 GroundStation5)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument7 thermograph2)
	(supports instrument7 image1)
	(calibration_target instrument7 GroundStation5)
	(calibration_target instrument7 Star6)
	(supports instrument8 infrared0)
	(supports instrument8 image1)
	(calibration_target instrument8 GroundStation2)
	(calibration_target instrument8 GroundStation5)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star4)
	(supports instrument9 infrared0)
	(supports instrument9 thermograph2)
	(supports instrument9 image1)
	(calibration_target instrument9 Star6)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 thermograph2)
	(calibration_target instrument10 Star6)
	(calibration_target instrument10 GroundStation5)
	(supports instrument11 image1)
	(supports instrument11 thermograph2)
	(supports instrument11 infrared0)
	(calibration_target instrument11 GroundStation2)
	(calibration_target instrument11 Star3)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star6)
)
(:goal (and
	(pointing satellite0 Planet7)
	(pointing satellite1 Phenomenon9)
	(pointing satellite3 Planet8)
	(pointing satellite5 Planet7)
	(have_image Planet7 infrared0)
	(have_image Planet8 infrared0)
	(have_image Phenomenon9 infrared0)
	(have_image Star10 image1)
	(have_image Phenomenon11 image1)
))

)

; plan
1. (switch_on instrument9 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument9)
   goals met: 0 of 9
2. (calibrate satellite5 instrument9 star6)
   added: (calibrated instrument9)
   goals met: 0 of 9
3. (turn_to satellite5 planet8 star6)
   deleted: (pointing satellite5 star6)
   added: (pointing satellite5 planet8)
   goals met: 0 of 9
4. (take_image satellite5 planet8 instrument9 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 1 of 9
5. (turn_to satellite5 phenomenon9 planet8)
   deleted: (pointing satellite5 planet8)
   added: (pointing satellite5 phenomenon9)
   goals met: 1 of 9
6. (take_image satellite5 phenomenon9 instrument9 infrared0)
   added: (have_image phenomenon9 infrared0)
   goals met: 2 of 9
7. (turn_to satellite5 phenomenon11 phenomenon9)
   deleted: (pointing satellite5 phenomenon9)
   added: (pointing satellite5 phenomenon11)
   goals met: 2 of 9
8. (turn_to satellite1 phenomenon9 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon9)
   goals met: 3 of 9
9. (turn_to satellite0 planet7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet7)
   goals met: 4 of 9
10. (take_image satellite5 phenomenon11 instrument9 image1)
   added: (have_image phenomenon11 image1)
   goals met: 5 of 9
11. (turn_to satellite3 planet8 star3)
   deleted: (pointing satellite3 star3)
   added: (pointing satellite3 planet8)
   goals met: 6 of 9
12. (turn_to satellite5 star10 phenomenon11)
   deleted: (pointing satellite5 phenomenon11)
   added: (pointing satellite5 star10)
   goals met: 6 of 9
13. (take_image satellite5 star10 instrument9 image1)
   added: (have_image star10 image1)
   goals met: 7 of 9
14. (turn_to satellite5 planet7 star10)
   deleted: (pointing satellite5 star10)
   added: (pointing satellite5 planet7)
   goals met: 8 of 9
15. (take_image satellite5 planet7 instrument9 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 9 of 9
